Revit 2027 API
ReturnAirflowType Enumeration
An enumerated type listing all the possible return airflow types for a space object.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReturnAirflowType
Public Enumeration ReturnAirflowType
public enum class ReturnAirflowType
type ReturnAirflowType
Members
Member name | Value | Description
ActualSupplyAirflow | 3 | Return Airflow Type is ActualSupplyAirflow.
CalculatedSupplyAirflow | 2 | Return Airflow Type is CalculatedSupplyAirflow.
Specified | 0 | Return Airflow Type is Specified.
SpecifiedSupplyAirflow | 1 | Return Airflow Type is SpecifiedSupplyAirflow.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace